package org.lihao.demo.core.util;

import java.util.Random;

/**
 * @author Lihao
 * @version V1.0
 * @Title: NickNameUtil.java
 * @Package org.lihao.demo.util
 * @Description Nick Name Util
 * @date 2018 04-09 9:52.
 */
public class NameUtil {

	final private static String[] familyNameArr=("赵,钱,孙,李,周,吴,郑,王,冯,陈,褚,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施" +
			",张,孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范,彭,郎,鲁,韦,昌,马,苗,凤,花,方,俞,任,袁" +
			",柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,皮,卞,齐,康,伍,余,元,卜,顾,孟,平" +
			",黄,和,穆,萧,尹,姚,邵,舒,汪,祁,毛,禹,狄,米,贝,明,臧,计,伏,成,戴,谈,宋,茅,庞,熊,纪,屈,项,祝,董,杜,阮,蓝,闵" +
			",席,季,麻,强,贾,路,娄,危,江,童,颜,郭,梅,盛,林,刁,钟,徐,邱,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,咎,管,卢,莫" +
			",经,房,裘,缪,干,解,应,宗,宣,丁,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,嵇,邢,滑,裴,陆,荣,翁,荀,羊,於,惠" +
			",甄,加,封,芮,羿,储,靳,汲,邴,糜,松,井,段,富,巫,乌,焦,巴,弓,牧,隗,山,谷,车,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宫,宁,仇" +
			",栾,暴,甘,钭,厉,戎,祖,武,符,刘,詹,束,龙,叶,幸,司,韶,郜,黎,蓟,薄,印,宿,白,怀,蒲,台,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙" +
			",池,乔,阴,胥,能,苍,双,闻,莘,党,翟,谭,贡,劳,逄,姬,申,扶,堵,冉,宰,郦,雍,璩,桑,桂,濮,牛,寿,通,边,扈,燕,冀,郏,浦,尚" +
			",农,温,别,庄,晏,柴,瞿,阎,充,慕,连,茹,习,宦,艾,鱼,容,向,古,易,慎,戈,廖,庚,终,暨,居,衡,步,都,耿,满,弘,匡,国,文,寇" +
			",广,禄,阙,东,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,勾,敖,融,冷,訾,辛,阚,那,简,饶,空,曾,毋,沙,乜,养,鞠,须,丰,巢,关" +
			",蒯,相,查,后,红,游,竺,权,逯,盖,益,桓,公,晋,楚,法,汝,鄢,涂,钦,缑,亢,况,有,商,牟,佘,佴,伯,赏,墨,哈,谯,笪,年,爱,阳" +
			",佟,琴,言,福,岳,帅,东郭,呼延,南宫,西门,司马,上官,欧阳,夏侯,诸葛,东方,尉迟,公羊,公冶,濮阳,淳于,申屠,公孙,乐正,轩辕" +
			",令狐,闾丘,长孙,慕容,,宇文,司徒,司空,司寇,端木").split(",");

	final private static String[] nameArr = ("英,梅,华,兰,珍,芳,伟,军,丽,敏,荣,勇,静,燕,娟,婷,强,云,杰,平,超,红,艳,磊,丹" +
			",萍,霞,斌,波,玲,涛,明,峰,浩,飞,辉,俊,鑫,鹏,林,慧,颖,洋,国,刚,莉,倩,娜,龙,亮,琴,凯,帅,雪,琳,晶,阳,博,兵,洁,芝,宇" +
			",宁,健,建,岩,帆,瑞,花,佳,香,欢,欣,莹,坤,利,旭,文,雷,彬,柳,晨,凤,璐,瑜,畅,玉,想,楠,东,杨,成,玉兰,桂兰,秀英,秀珍" +
			",桂英,玉梅,玉珍,凤英,玉英,红梅,建华,兰英,建国,建军,淑珍,春梅,海燕,冬梅,秀荣,桂珍,秀云,桂荣,志强,秀梅,丽娟,婷婷,玉华" +
			",秀兰,雪梅,淑兰,丽丽,秀芳,淑英,桂芳,丽华,丹丹,桂香,淑华,秀华,桂芝,小红,金凤,红霞,建平,桂花,凤兰,子轩,浩宇,博文,宇轩" +
			",子涵,雨泽,皓轩,俊杰,俊熙,子豪,天佑,致远,子涵,欣怡,诗涵,梦琪,嘉怡,可馨,思彤,可欣,雨彤").split(",");

	public static String getRandomName(){
		Random rnd = new Random();
		String familyName = familyNameArr[rnd.nextInt(familyNameArr.length)];
		String name = nameArr[rnd.nextInt(nameArr.length)];
		return familyName+name;
	}
}
